<?php

/*
	Ссылка на изучение: http://ruseller.com/lessons.php?id=1189

	Хранимая процедура - это способ инкапсуляции повторяющихся действий в MySQL. Даёт возможност изоляции пользователей от таблиц базы данных. Это позволяет давать доступ к хранимым процедурам, но не к самим данным таблиц. 

	Инструмент, в котором я работаю, называется MySQL Query Browser, он достаточно стандартен для взаимодействия с базами данных. Инструмент командной строки MySQL - это еще один превосходный выбор. Потому что phpmyadmin не может работать с процедурами.
*/



