<?php

/*
	Структуры данных - это способы хранить и организовывать данные, чтобы эффективней решать различные задачи.

	Алгоритм — последовательность совершаемых действий.

	Структуры данных реализованы с помощью алгоритмов, алгоритмы — с помощью структур данных. Всё состоит из структур данных и алгоритмов, вплоть до работы копмьютера.

	Структуры данных позволяют производить 4 основных типа действий: доступ, поиск, вставку и удаление.

	Для сравнения производительности алгоритмов используется грубое измерение средней производительности и производительности в худшем случае, для обозначения которых используется термин «О». Значения О:

		O(1) - константная (охрененно)

		O(log N) - логарифмическая (круто)

		O(N) - линейная (нормас)

		O(N log N) - линейно-логарифмическая (блииин)

		O(N ^ 2) - полиномиальная (отстой)

		O(2 ^ N) - экспоненциальная (отвратительно)

		O(N!) - факториальная (твою ж мать)

	В языках программирования отсчёт начинается с 0 — потому, что так работает память. Чтобы прочитать первый фрагмент памяти, вы читаете с 0 до 1, второй — с 1 до 2 и т.д.

	Использование памяти — сложная задача, и для удобной работы с ней существуют дополнительные уровни абстракции. Абстракции имеют два дополнительных назначения:

		- Сохраняют данные в памяти таким образом, чтобы с ними было эффективно и быстро работать.

		- Сохраняют данные в памяти так, чтобы их было проще использовать.
*/

